<template>
  <pre class="min-h-screen py-12 whitespace-pre-wrap">
    นโยบายความเป็นส่วนตัว (Privacy Policy)
    แก้ไขครั้งที่ 3
    วันที่ 6 มิถุนายน พ.ศ. 2569

    เว็บไซต์เปย์มัวให้ความสำคัญกับความเป็นส่วนตัวของท่านเป็นอย่างยิ่ง
    นโยบายนี้อธิบายถึงข้อมูลที่เราเก็บรวบรวมและวิธีการที่เราดูแลรักษา

    1. ข้อมูลที่เรารวบรวม

        เว็บไซต์เปย์มัวสามารถรับข้อมูลที่อยู่ IP ที่สามารถระบุตัวตนได้เนื่องจากเป็นพื้นฐาน
        ของระบบ HTTP จึงไม่สามารถหลีกเลี่ยงได้ เว็บไซต์เปย์มัวมีการใช้ข้อมูล IP เมื่อต่อกับ WebSocket
        เพื่อบันทึกว่า IP มีการเชื่อมต่อมากี่ครั้งต่อนาที เพื่อป้องกันการสแปมรีเควสหาเซิร์ฟเวอร์
        และสามารถตรวจสอบข้อมูลเหล่านี้ได้ผ่าน Cloudflare Logs ซึ่งเป็นบริการของบริษัท Cloudflare

        เว็บไซต์เปย์มัวมีการเก็บที่อยู่กระเป๋าเงินดิจิตัลที่ถูกสร้างและให้บริการโดย Web3Auth
        และข้อมูลที่ผู้ใช้ได้กรอก คือ ยูสเซอร์เนม ชื่อที่แสดง การปรับแต่งของโอเวอร์เลย์ การปรับแต่งหน้าโดเนท
        รูปภาพโปรไฟล์ รูปภาพพื้นหลัง รูปภาพที่แสดงเมื่อโดเนทในโอเวอร์เลย์ และเสียงที่เล่นเมื่อโดเนทในโอเวอร์เลย์
        รวมไปถึงข้อมูลการทำธุรกรรมที่ได้รับจากเครือข่าย Base ซึ่งเป็นข้อมูลสาธารณะ สามารถตรวจสอบได้
        ผ่านข้อมูลแฮชของธุรกรรม หรือ Transaction Hash ซึ่งผู้ใช้จะถูกเปลี่ยนเส้นทางไปยังบริการ basescan.org
        หลังจากธุรกรรมเสร็จสิ้น เพื่อยืนยันความโปร่งใสและความถูกต้องของธุรกรรมครั้งล่าสุด

        เว็บไซต์เปย์มัวไม่มีการเก็บข้อมูล Analytics ของผู้ใช้ มีการใช้คุกกี้ที่จำเป็นต่อการยืนยันตัวตนเพื่อ
        ให้ผู้ใช้ไม่ต้องล็อกอินใหม่ทุกรอบเมื่อเว็บไซต์มีการรีเฟรชหน้า ให้บริการโดย Web3Auth
        และผู้ให้บริการเข้าสู่ระบบภายนอกหากผู้ใช้ใช้บริการ Social Login ดังนี้ Google, Discord, LINE,
        Twitch, Facebook และ MetaMask

    2. วัตถุประสงค์การใช้ข้อมูล

        เว็บไซต์เปย์มัวเก็บข้อมูลที่อยู่กระเป๋าเงินดิจิตัลเพื่อจุดประสงค์ดังนี้
          ก. เพื่อสร้างรีเควสไปยังเครือข่าย Base เพื่อก่ออีเวนต์ธุรกรรม หรือ Transaction
          ข. เพื่อรับข้อมูลการทำธุรกรรมที่เกี่ยวข้องกับกระเป๋าเงินดิจิตัลนั้น ๆ
          ค. เพื่อระบุตัวตนของผู้ใช้ไม่ให้ซ้ำกับผู้อื่น
          ง. เพื่อแสดงผลยอดเงินในกระเป๋าของผู้ใช้

        เก็บข้อมูลแฮชทางธุรกรรม หรือ Transaction Hash เพื่อจุดประสงค์ดังนี้
          ก. เพื่อบันทึกประวัติการทำธุรกรรมของผู้ใช้
          ข. เพื่อแสดงรายการธุรกรรมที่ผู้ใช้ได้สร้างและได้รับ

        เก็บข้อมูลที่อยู่ IP หรือ IP Address เพื่อจุดประสงค์ดังนี้
          ก. เพื่อบันทึกจำนวนครั้งที่ต่อกับ WebSocket ของเปย์มัว
          ข. เพื่อป้องกันการสแปมรีเควสต่อเซิร์ฟเวอร์ของเปย์มัว

    3. การแบ่งปันข้อมูล

        เว็บไซต์เปย์มัวไม่มีนโยบายการขายข้อมูลไปให้บุคคลที่สาม
        ข้อมูลธุรกรรมทั้งหมดเป็นสาธารณะสามารถตรวจสอบได้ เนื่องจากเป็นคุณสมบัติพื้นฐานของระบบบล็อกเชน
        อย่างไรก็ตามข้อมูลธุรกรรมบนบล็อกเชนจะไม่รวมข้อมูลส่วนบุคคลที่ผู้ใช้กรอกไว้ในเว็บไซต์เปย์มัว เช่น ชื่อที่แสดง รูปภาพ หรืออีเมล

        ข้อมูลบางส่วนอาจมีการส่งต่อไปให้ผู้บริการกระเป๋าเงินและผู้ให้บริการเข้าสู่ระบบภายนอก
        เช่น Web3Auth หรือ Google เนื่องจากมีความจำเป็นในการยืนยันตัวตน

        เว็บไซต์เปย์มัวอาจเปิดเผยข้อมูลเมื่อมีข้อกำหนดตามกฎหมายหรือคำสั่งจากหน่วยงานที่มีอำนาจตามกฎหมาย

    4. ความปลอดภัย

        เว็บไซต์เปย์มัวใช้ไลบรารี่มาตรฐานในการเชื่อมต่อกับเครือข่าย Base Mainnet
        นั่นคือ "viem" และใช้ไลบรารี่ "web3auth" ที่ได้รับจากแหล่งมาตรฐาน (npm)
        มีการใช้ RPC URL และ USDC Contract Address ทางการจากแหล่งที่เชื่อถือได้
        สามารถตรวจสอบได้โดยตรงจากหน้าต่าง Popup เมื่อกดทำธุรกรรม หรือเทียบจากเว็บไซต์ทางการของ Circle และ Base
          - https://developers.circle.com/stablecoins/usdc-contract-addresses
          - https://docs.base.org/base-chain/quickstart/connecting-to-base

        มีการบังคับความปลอดภัยขั้นพื้นฐานในการบันทึกข้อมูลแต่ละครั้ง โดยต้อง
        Sign Message เพื่อรับรองว่าผู้ที่ส่งคำขอร้องถึงเซิร์ฟเวอร์นั้นคือคนเดียวกัน
        และมีการใช้ HTTPS เข้ารหัสข้อมูลที่รับส่งจากเซิร์ฟเวอร์ เพื่อป้องกันการถูกบุคคลที่สามอ่านข้อมูล

        ข้อมูลของผู้ใช้ถูกจัดเก็บบนเซิร์ฟเวอร์ของเปย์มัว ที่ไม่สามารถแก้ไขได้โดยตรงจากผู้ที่ไม่มีสิทธิ์ในการเข้าถึงเซิร์ฟเวอร์
        ต้องแก้ไขจาก endpoint ของ paypoint ที่มีให้เท่านั้น และมีการยืนยันตัวตนก่อนเพื่อป้องกัน
        บุคคลอื่นเขียนข้อมูลได้

        ซอร์สโค้ดของเว็บไซต์เปย์มัวรวมถึง Backend ของเปย์มัว (paypoint.otternoon.com)
        นั้นมีการเปิดเผยซอร์สโค้ดผ่านสัญญาอนุญาตแบบเปิดเผยซอร์สโค้ด GNU Affero General Public License v3.0
        สามารถเข้าถึงได้ผ่านลิงก์ต่อไปนี้
          - paypoint.otternoon.com ตรวจสอบได้ที่ https://github.com/mymanao/paymoi-server
          - paymoi.otternoon.com ตรวจสอบได้ที่ https://github.com/mymanao/paymoi-web

    5. อายุของข้อมูล

        ข้อมูลของผู้ใช้บนเว็บไซต์เปย์มัวจะยังอยู่หากบัญชียังมีการใช้งาน และสามารถยื่นลบบัญชีได้ผ่านอีเมลติดต่อ
        ในส่วนติดต่อเราในหน้านี้ และในอนาคตอาจมีปุ่มเพื่อลบบัญชีให้สะดวกขึ้น

        ข้อมูล IP Address จะไม่ถูกบันทึกลงฐานข้อมูล แต่จะเก็บไว้ในหน่วยความจำ ซึ่งจะรีเซ็ตใหม่ทุกครั้งเมื่อ
        เซิร์ฟเวอร์มีการรีสตาร์ท หรือเมื่อครบ 3 นาทีหลังจากรีเควสมายังเซิร์ฟเวอร์ครั้งล่าสุด
        และในบริการ Cloudflare Logs ที่อยู่ IP จะถูกลบไปภายใน 24 ชั่วโมง

        ข้อมูลธุรกรรมบนบล็อกเชนไม่สามารถลบได้ เนื่องจากเป็นพื้นฐานของระบบ
        สามารถตรวจสอบได้จากบริการ Basescan.org โดยใส่ Transaction Hash

    6. สิทธิของผู้ใช้

        ผู้ใช้สามารถร้องขอเข้าถึง แก้ไข หรือลบบัญชีและข้อมูลที่จัดเก็บโดยเปย์มัวได้ผ่านช่องทางติดต่อที่ระบุไว้ในนโยบายนี้
        ทั้งนี้ข้อมูลที่ถูกบันทึกบนบล็อกเชนไม่สามารถแก้ไขหรือลบได้

    7. การเปลี่ยนแปลงนโยบาย

        นโยบายนี้อาจมีการปรับปรุงตามความเหมาะสม
        ท่านสามารถตรวจสอบเวอร์ชันล่าสุดได้ที่เว็บไซต์นี้เสมอ

    8. ติดต่อเรา

        หากมีคำถามเกี่ยวกับความเป็นส่วนตัว ติดต่อได้ที่
        อีเมล: contact@otternoon.com
        ให้บริการโดย MyManao
        ผู้ควบคุมข้อมูลส่วนบุคคล: Tinnaphat Somsang
  </pre>
</template>