<template>
  <pre class="min-h-screen py-12 whitespace-pre-wrap">
    นโยบายความเป็นส่วนตัว (Privacy Policy)
    แก้ไขครั้งที่ 2
    วันที่ 4 มิถุนายน พ.ศ. 2569

    เว็บไซต์เปย์มัวให้ความสำคัญกับความเป็นส่วนตัวของท่านเป็นอย่างยิ่ง
    นโยบายนี้อธิบายถึงข้อมูลที่เราเก็บรวบรวมและวิธีการที่เราดูแลรักษา

    1. ข้อมูลที่เรารวบรวม
        เว็บไซต์เปย์มัวสามารถรับข้อมูลที่อยู่ IP ที่สามารถระบุตัวตนได้เนื่องจากเป็นพื้นฐาน
        ของระบบ HTTP จึงไม่สามารถหลีกเลี่ยงได้ แต่อย่างไรก็ตาม เว็บไซต์เปย์มัวไม่มีการ
        นำข้อมูลนี้ไปใช้ หรือบันทึกลงฐานข้อมูล Backend ของเปย์มัว (paypoint.otternoon.com)
        แต่ยังสามารถตรวจสอบข้อมูลเหล่านี้ได้ผ่าน Cloudflare Logs ซึ่งเป็นบริการของบริษัท Cloudflare
        เว็บไซต์เปย์มัวมีการเก็บที่อยู่กระเป๋าเงินดิจิตัลที่ถูกสร้างและให้บริการโดย Web3Auth.io
        และข้อมูลที่ผู้ใช้ได้กรอก เช่น ยูสเซอร์เนม ชื่อที่แสดง และอื่น ๆ
        รวมไปถึงข้อมูลการทำธุรกรรมที่ได้รับจากเครือข่าย Base ซึ่งเป็นข้อมูลสาธารณะ สามารถตรวจสอบได้
        ผ่านข้อมูลแฮชของธุรกรรม หรือ Transaction Hash

    2. วัตถุประสงค์การใช้ข้อมูล
        เว็บไซต์เปย์มัวเก็บข้อมูลที่อยู่กระเป๋าเงินดิจิตัลเพื่อจุดประสงค์ดังนี้
          ก. เพื่อสร้างรีเควสไปยังเครือข่าย Base เพื่อก่ออีเวนต์ธุรกรรม หรือ Transaction
          ข. เพื่อรับข้อมูลการทำธุรกรรมที่เกี่ยวข้องกับกระเป๋าเงินดิจิตัลนั้น ๆ
          ค. เพื่อระบุตัวตนของผู้ใช้ไม่ให้ซ้ำกับผู้อื่น
          ง. เพื่อแสดงผลยอดเงินในกระเป๋าของผู้ใช้
        และเก็บข้อมูลแฮชทางธุรกรรม หรือ Transaction Hash เพื่อจุดประสงค์ดังนี้
          ก. เพื่อบันทึกประวัติการทำธุรกรรมของผู้ใช้

    3. การแบ่งปันข้อมูล
        เว็บไซต์เปย์มัวไม่มีนโยบายการขายข้อมูลไปให้บุคคลที่สาม
        ข้อมูลธุรกรรมทั้งหมดเป็นสาธารณะสามารถตรวจสอบได้
        เนื่องจากเป็นคุณสมบัติพื้นฐานของระบบบล็อกเชน
        อย่างไรก็ตามข้อมูลธุรกรรมจะไม่แสดงผลข้อมูลส่วนตัว เช่น ชื่อ-นามสกุล อีเมล
        และจะแสดงเฉพาะที่อยู่กระเป๋าเงินดิจิตัลเท่านั้น

    4. ความปลอดภัย
        เว็บไซต์เปย์มัวใช้ไลบรารี่มาตรฐานในการเชื่อมต่อกับเครือข่าย Base Mainnet
        นั่นคือ "viem" และใช้ไลบรารี่ "web3auth" ที่ได้รับจากแหล่งมาตรฐาน (npm)
        มีการบังคับความปลอดภัยขั้นพื้นฐานในการบันทึกข้อมูลแต่ละครั้ง โดยต้อง
        Sign Message เพื่อรับรองว่าผู้ที่ส่งคำขอร้องถึงเซิร์ฟเวอร์นั้นคือคนเดียวกัน
        ซอร์สโค้ดของเว็บไซต์เปย์มัวรวมถึง Backend ของเปย์มัว (paypoint.otternoon.com)
        นั้นมีการเปิดเผยซอร์สโค้ดผ่านสัญญาอนุญาตแบบเปิดเผยซอร์สโค้ด GNU Affero General Public License v3.0
        สามารถเข้าถึงได้ผ่านลิงก์ต่อไปนี้
          paypoint.otternoon.com ตรวจสอบได้ที่ https://github.com/mymanao/paymoi-server
          paymoi.otternoon.com ตรวจสอบได้ที่ https://github.com/mymanao/paymoi-web

    5. การเปลี่ยนแปลงนโยบาย
        นโยบายนี้อาจมีการปรับปรุงตามความเหมาะสม
        ท่านสามารถตรวจสอบเวอร์ชันล่าสุดได้ที่เว็บไซต์นี้เสมอ

    6. ติดต่อเรา
        หากมีคำถามเกี่ยวกับความเป็นส่วนตัว ติดต่อได้ที่
        อีเมล: tinvv@outlook.co.th
  </pre>
</template>