<template>
  <pre class="min-h-screen py-12 whitespace-pre-wrap">
    ข้อตกลงการใช้บริการ (Terms of Service)
    แก้ไขครั้งที่ 3
    วันที่ 6 มิถุนายน พ.ศ. 2569

    กรุณาอ่านข้อตกลงในการใช้บริการของเปย์มัวอย่างละเอียด การใช้งานบริการนี้ถือว่าท่านตกลงในการยอมรับเงื่อนไขที่ระบุไว้ในหน้านี้

    1. การใช้บริการของเปย์มัว

          เว็บไซต์เปย์มัวพัฒนาโดย MyManao และผู้ที่มีส่วนร่วม เป็นแพลตฟอร์มกลาง
          ในการประสานธุรกรรมเหรียญดิจิทัล USD Coin บนเครือข่าย Base

          เว็บไซต์เปย์มัวไม่ได้เป็นผู้ให้บริการกระเป๋าเงินดิจิทัล
          และไม่มีอำนาจในการครอบครองหรือดูแลเงินทุนหรือเหรียญดิจิตัลของผู้ใช้
          ธุรกรรมทั้งหมดเกิดขึ้นโดยตรงผ่านระบบบล็อกเชน ผู้ใช้อาจต้องชำระค่าธรรมเนียมเครือข่ายบล็อกเชน หรือ Gas Fee
          ซึ่งไม่ได้ถูกกำหนดหรือควบคุมโดยเปย์มัว

          ห้ามใช้บริการเพื่อกระทำการที่ผิดกฎหมาย การฉ้อโกง การฟอกเงิน การหลอกลวง
          หรือกิจกรรมอื่นใดที่อาจก่อให้เกิดความเสียหายต่อบุคคลอื่นหรือระบบของเปย์มัว

    2. การจัดการกระเป๋าเงิน

          ผู้ใช้ลงทะเบียนผ่านบริการ Web3Auth สามารถลงชื่อเข้าใช้ได้ผ่าน
          บัญชีโซเชี่ยลมีเดียต่าง ๆ ที่เปิดให้ใช้งาน หรือเชื่อมต่อกับผู้ให้บริการกระเป๋าเงินดิจิตัล MetaMask

          ผู้ใช้ต้องทำการลงชื่อเข้าใช้เพื่อสร้างและจัดการกระเป๋าเงินดิจิทัลสำหรับการทำธุรกรรม
          เว็บไซต์เปย์มัวเป็นเพียงตัวกลางที่ช่วยให้การเชื่อมต่อนี้สะดวกขึ้น และสามารถจัดการ
          กระเป๋าเงินดิจิตัลได้ที่เว็บไซต์ของผู้ให้บริการ https://wallet.web3auth.io/

    3. ความเสี่ยงและการยอมรับเงื่อนไข

          การทำธุรกรรมผ่านบล็อกเชนไม่สามารถยกเลิกหรือเรียกคืนได้ ผู้ใช้มีหน้าที่ตรวจสอบที่อยู่กระเป๋าเงินให้ถูกต้องก่อนยืนยัน
          เว็บไซต์เปย์มัวไม่รับผิดชอบต่อความเสียหายที่เกิดจากการส่งเหรียญดิจิทัลไปยังที่อยู่กระเป๋าเงินที่ไม่ถูกต้อง
          การสูญเสียการเข้าถึงบัญชีของผู้ใช้ หรือปัญหาที่เกิดจากเครือข่ายบล็อกเชนและผู้ให้บริการภายนอก

    4. การเปลี่ยนแปลงข้อตกลง

          ขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงนี้ได้ตลอดเวลา การเปลี่ยนแปลงจะมีผลทันทีเมื่อประกาศบนเว็บไซต์
          การใช้งานเว็บไซต์เปย์มัวต่อไปหลังจากมีการประกาศเปลี่ยนแปลง ถือว่าผู้ใช้ยอมรับข้อตกลงฉบับที่แก้ไขแล้ว
          จะมีการประกาศเปลี่ยนแปลงข้อตกลงในบัญชีโซเชี่ยลมีเดีย สามารถตรวจสอบการเปลี่ยนแปลงได้ที่ https://x.com/ByMyManao

    5. การติดต่อ

          หากมีคำถามหรือข้อสงสัยเกี่ยวกับข้อตกลงหรือบริการนี้
          สามารถติดต่อผู้ให้บริการได้ที่อีเมล contact@otternoon.com
  </pre>
</template>