<template>
  <pre class="min-h-screen py-12 whitespace-pre-wrap">
    ข้อตกลงการใช้บริการ (Terms of Service)
    แก้ไขครั้งที่ 2
    วันที่ 4 มิถุนายน พ.ศ. 2569

    กรุณาอ่านข้อตกลงในการใช้บริการของเปย์มัวการใช้งานบริการนี้ถือว่าท่านตกลงในการยอมรับเงื่อนไขที่ระบุไว้ในหน้านี้

    1. การใช้บริการของเปย์มัว
         เว็บไซต์เปย์มัวพัฒนาโดยนายติณณภัทร์ สมแสง (MyManao) เป็นแพลตฟอร์มกลาง
         ในการประสานธุรกรรมเหรียญดิจิทัล USD Coin บนเครือข่าย Base

         เว็บไซต์เปย์มัวไม่ได้เป็นผู้ให้บริการกระเป๋าเงินดิจิทัล
         และไม่มีอำนาจในการครอบครองหรือดูแลเงินทุนหรือเหรียญดิจิตัลของผู้ใช้
         ธุรกรรมทั้งหมดเกิดขึ้นโดยตรงผ่านระบบบล็อกเชน

    2. การจัดการกระเป๋าเงิน
         ผู้ใช้ลงทะเบียนผ่านบริการ Web3Auth สามารถลงชื่อเข้าใช้ได้ผ่าน
         บัญชีโซเชี่ยลมีเดียต่าง ๆ ที่เปิดให้ใช้งาน หรือเชื่อมต่อกับผู้ให้บริการกระเป๋าเงินดิจิตัล MetaMask
         ผู้ใช้ต้องทำการลงชื่อเข้าใช้เพื่อสร้างและจัดการกระเป๋าเงินดิจิทัลสำหรับการทำธุรกรรม
         เว็บไซต์เปย์มัวเป็นเพียงตัวกลางที่ช่วยให้การเชื่อมต่อนี้สะดวกขึ้น และสามารถจัดการ
         กระเป๋าเงินดิจิตัลได้ที่เว็บไซต์ของผู้ให้บริการ https://wallet.web3auth.io/

    3. ความเสี่ยงและการยอมรับเงื่อนไข
         การทำธุรกรรมผ่านบล็อกเชนไม่สามารถยกเลิกหรือเรียกคืนได้
         ผู้ใช้มีหน้าที่ตรวจสอบที่อยู่กระเป๋าเงินให้ถูกต้องก่อนยืนยัน
         การใช้งานเว็บไซต์เปย์มัวถือว่าท่านยอมรับเงื่อนไขทั้งหมดนี้

    4. การเปลี่ยนแปลงข้อตกลง
          ขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงนี้ได้ตลอดเวลา
          การเปลี่ยนแปลงจะมีผลทันทีเมื่อประกาศบนเว็บไซต์
          จะมีการประกาศเปลี่ยนแปลงข้อตกลงในบัญชีโซเชี่ยลมีเดีย
          สามารถตรวจสอบการเปลี่ยนแปลงได้ที่ https://x.com/ByMyManao

    5. การติดต่อ
         หากมีคำถามหรือข้อสงสัยเกี่ยวกับข้อตกลงหรือบริการนี้
         สามารถติดต่อผู้พัฒนาได้ที่อีเมล tinvv@outlook.co.th
  </pre>
</template>